In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [6]:
dframe1 = DataFrame({'key':['x','z','y','z','x','x'],'data_set_1':np.arange(6)})
dframe1

   data_set_1 key
0           0   x
1           1   z
2           2   y
3           3   z
4           4   x
5           5   x

In [12]:
dframe2 = DataFrame({'key':['q','y','z'], 'data_set_2':[1,2,3]})
dframe2

   data_set_2 key
0           1   q
1           2   y
2           3   z

In [13]:
pd.merge(dframe1,dframe2)

   data_set_1 key  data_set_2
0           1   z           3
1           3   z           3
2           2   y           2

In [14]:
pd.merge(dframe1, dframe2, on = 'key')

   data_set_1 key  data_set_2
0           1   z           3
1           3   z           3
2           2   y           2

In [15]:
pd.merge(dframe1, dframe2, on ='key', how = 'left')

   data_set_1 key  data_set_2
0           0   x         NaN
1           1   z           3
2           2   y           2
3           3   z           3
4           4   x         NaN
5           5   x         NaN

In [16]:
dframe2

   data_set_2 key
0           1   q
1           2   y
2           3   z

In [17]:
pd.merge(dframe1, dframe2, on = 'key', how = 'right')

   data_set_1 key  data_set_2
0           1   z           3
1           3   z           3
2           2   y           2
3         NaN   q           1

In [18]:
pd.merge(dframe1, dframe2, on = 'key', how = 'outer')

   data_set_1 key  data_set_2
0           0   x         NaN
1           4   x         NaN
2           5   x         NaN
3           1   z           3
4           3   z           3
5           2   y           2
6         NaN   q           1

In [21]:
dframe3 = DataFrame({'key': ['x','x','x','y','z','z'], 'data_set_3':range(6)})
dframe3

   data_set_3 key
0           0   x
1           1   x
2           2   x
3           3   y
4           4   z
5           5   z

In [25]:
dframe4 = DataFrame({'key': ['y','y','x','x','z'], 'data_set_4' : range(5)})
dframe4

   data_set_4 key
0           0   y
1           1   y
2           2   x
3           3   x
4           4   z

pd.merge(dframe3, dframe4)

In [27]:
df_left = DataFrame({'key1' : ['SF','SF','LA'], 
                     'key2' : ['one','two','one'], 
                     'left_data' : [10,20,30]})

In [31]:
df_right = DataFrame ({'key1' : ['SF', 'SF', 'LA' , 'LA'],
                      'key2' : ['one', 'one', 'one', 'two'],
                      'right_data': [40, 50, 60, 70]})

In [32]:
df_right

  key1 key2  right_data
0   SF  one          40
1   SF  one          50
2   LA  one          60
3   LA  two          70

In [33]:
df_left

  key1 key2  left_data
0   SF  one         10
1   SF  two         20
2   LA  one         30

In [34]:
pd.merge(df_left,df_right, on = ['key1','key2'], how='outer')

  key1 key2  left_data  right_data
0   SF  one         10          40
1   SF  one         10          50
2   SF  two         20         NaN
3   LA  one         30          60
4   LA  two        NaN          70

In [36]:
pd.merge(df_left,df_right, on='key1')

  key1 key2_x  left_data key2_y  right_data
0   SF    one         10    one          40
1   SF    one         10    one          50
2   SF    two         20    one          40
3   SF    two         20    one          50
4   LA    one         30    one          60
5   LA    one         30    two          70

In [38]:
pd.merge(df_left, df_right, on = 'key1', suffixes=('_lefty','_righty'))

  key1 key2_lefty  left_data key2_righty  right_data
0   SF        one         10         one          40
1   SF        one         10         one          50
2   SF        two         20         one          40
3   SF        two         20         one          50
4   LA        one         30         one          60
5   LA        one         30         two          70